# 1. Создайте кортеж из диапазона чисел от 10 до 20.
# Затем посчитайте сумму всех элементов.

tuple1 = tuple([i for i in range(10,21)])
print(sum(tuple1))