# 3. Даны средние температуры каждого месяца (кортеж).
# Нужно посчитать среднюю температуру за год.

temp = (-10,-12,5,10,18,21,25,24,19,14,7,-8)
print(f'Средня температура за год равна', (sum(temp))/12)