# Задача 1
a = int(input('Введите число: '))
print('Предыдущее число:', a-1, ', а следующее число', a+1)