# Задача 2
a = int(input('Введите трехзначное число: '))
print((a % 100)%10)