# Задача 3
x = int(input('Введите переменную x: '))
y = int(input('Введите переменную y: '))
z = ((6*x)/((x**2)-(y**2)))-(3/(x+y))
print(z)