# Задача 4
a = int(input('Введите день: '))
b = int(input('Введите месяц: '))
c = int(input('Введите год: '))
print(a,'.',b,'.',c)