# Задача 2
a = int(input('Введите трехзначное число: '))
b = str(a)
print(b[-2],',',b[-1])