# Задача 1. Выведите числа в диапазоне от 50 до 60.
for i in range(50,61):
    print(i)